#+title: A primer on lisp
#+OPTIONS: ^:nil H:2 num:t toc:2
#+DATE: 2024/06/04
#+Author: Alán F. Muñoz
#+LaTeX_CLASS: beamer
#+BEAMER_THEME: metropolis
#+BEAMER_FRAME_LEVEL: 3
#+LATEX_HEADER: \usepackage{ragged2e}
#+latex_header: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \newenvironment{JUSTIFYRIGHT}{\begin{FlushRight}}{\end{FlushRight}}
#+PROPERTY: header-args:emacs-lisp :session *emacs-lisp* :eval yes :exports both :results verbatim
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)

*** Python :B_exampleblock:BMCOL:
:PROPERTIES:
:BEAMER_col: 0.4
:BEAMER_env: exampleblock
:END:

Data:
 - =[]= lists
 - ={}= dicts/sets
Code:
 - =def= functions
 - =class= classes
Example:

#+begin_src python :session py :eval yes :exports both
[1, 2, 3]
#+end_src

#+RESULTS:
| 1 | 2 | 3 |

*** Lisp :B_exampleblock:BMCOL:
:PROPERTIES:
:BEAMER_col: 0.4
:BEAMER_env: exampleblock
:END:

Data:
 - =()=  all lists
Code:
 - =()= functions/classes
Example:
#+begin_src emacs-lisp
'(1 2 3)
#+end_src

#+RESULTS:
: (1 2 3)

** Basic operations
#+begin_src emacs-lisp
(+ 2 2)
#+end_src

#+RESULTS:
: 4

** Basic operations
#+begin_src emacs-lisp
(+ 2 (+ 1 1))
#+end_src

#+RESULTS:
: 4

** Setting variables
#+begin_src emacs-lisp :tangle yes
(setq a 1)
#+end_src

#+RESULTS:
: 1

For =FP= fans: let-in structures are the norm.
#+begin_src emacs-lisp :tangle yes
(let  ((a 3)
       (b 2))
   (+ a b))
#+end_src

#+RESULTS:
: 5

** The primitive data type: Cons
#+begin_src emacs-lisp
(setq cons-cell (cons 'rose 'violet) )
cons-cell
#+end_src

#+RESULTS:
: (rose . violet)

Equivalent to
#+begin_src emacs-lisp
'(rose . violet)
#+end_src

*** Connected cons cells are lists
#+begin_src emacs-lisp
'(rose . (violet . (buttercup)))
#+end_src

#+RESULTS:
: (rose violet buttercup)

*** Using "List"
#+begin_src emacs-lisp
(list 'rose 'violet 'buttercup)
#+end_src

#+RESULTS:
: (rose violet buttercup)

** Lists
Lists have their own constructor
#+begin_src emacs-lisp
(list 1 3 2 4)
#+end_src

#+RESULTS:
: (1 3 2 4)

Equivalent to a quote (='=)
#+begin_src emacs-lisp
'(1 3 2 4)
#+end_src

** CAR + CDR on lists
In any list, the first item is the value and the second is a link to the next value.

#+begin_src emacs-lisp
(setq my-list '(1 3 2 4))
(car my-list)
#+end_src

#+RESULTS:
: 1


#+begin_src emacs-lisp
(cdr my-list)
#+end_src

#+RESULTS:
: (3 2 4)


** =C{AD}R= functions enable processing lists with recursion.
#+begin_src emacs-lisp
(cadr my-list)
#+end_src

#+RESULTS:
: 3

#+begin_src emacs-lisp
(caddr my-list)
#+end_src

#+RESULTS:
: 2

#+begin_src emacs-lisp
(cadddr my-list)
#+end_src

#+RESULTS:
: 4

** There is also the (boring) =nth=
#+begin_src emacs-lisp
(nth 2 my-list)
#+end_src

#+RESULTS:
: 2

Note that it is zero-indexed.
** The basics: Flow control
#+begin_src emacs-lisp
(setq myvar 3)
#+end_src

#+RESULTS:
: 3

#+begin_src emacs-lisp
(if (eql myvar 2) "The same" "Not the same")
#+end_src

#+RESULTS:
: "Not the same"

** The basics: Lambda
#+begin_src emacs-lisp :results verbatim
(lambda (x) (+ 1  x))
#+end_src

#+RESULTS:
: (lambda (x) (+ 1 x))


It returns a function that we can use at the start of a list.
#+begin_src emacs-lisp
((lambda (x) (+ 1  x)) 2)
#+end_src

#+RESULTS:
: 3

or the built-in =1+=

#+begin_src emacs-lisp
(1+ 2)
#+end_src

#+RESULTS:
: 3

You can use almost any symbol in variable and function names.

** The basics: maps and filter
#+begin_src emacs-lisp
(mapcar '1+ my-list)
#+end_src

#+RESULTS:
: (2 4 3 5)

Two ways of filtering. Dash:
#+begin_src emacs-lisp :tangle yes
(-filter 'math-evenp my-list)
#+end_src

#+RESULTS:
: (2 4)

Common Lisp:
#+begin_src emacs-lisp :tangle yes
(cl-remove-if-not 'cl-evenp my-list)
#+end_src

#+RESULTS:
: (2 4)

** The basics: Function definition
#+begin_src emacs-lisp
(defun has-cat? (text)
  (if (s-contains? "cat" text)
  "Cat!"  "Nae :("))
#+end_src

#+RESULTS:
: has-cat?

#+begin_src emacs-lisp
(has-cat? "giraffe dog ant")
#+end_src

#+RESULTS:
: "Nae :("

#+begin_src emacs-lisp
(has-cat? "shark cat elephant")
#+end_src

#+RESULTS:
#+begin_export latex
"
{\\fontspec{Symbola}\\char\"1F343}
"
#+end_export

** How do we know if a function will be evaluated?
These are all (kind-of) equivalent
#+begin_src emacs-lisp
(list (quote has-cat?)
      'has-cat?
      `has-cat?
      #'has-cat?)
#+end_src

#+RESULTS:
: (has-cat? has-cat? has-cat? has-cat?)

But not all of these
#+begin_src emacs-lisp
'((quote has-cat?)
 'has-cat?
  #'has-cat?)
#+end_src

#+RESULTS:
: ('has-cat? 'has-cat? #'has-cat?)

** We can selectively evaluate terms
The backquote (=`=) is similar to the quote (='=) but evaluates elements preceded by a comma.
#+begin_src emacs-lisp
(let ((text "kittycat"))
`((has-cat? text)
 '(has-cat? text)
 ,(has-cat? text)))
#+end_src

#+RESULTS:
: ((has-cat? text) '(has-cat? text) "Cat!")

*** Insert on left :B_exampleblock:BMCOL:
:PROPERTIES:
:BEAMER_env: exampleblock
:BEAMER_col: 0.45
:END:
#+begin_src emacs-lisp
(->  10
      (- 5)
      (+ 7)
      (* 3))
#+end_src

#+RESULTS:
: 36

*** Insert on right :B_exampleblock:BMCOL:
:PROPERTIES:
:BEAMER_env: exampleblock
:BEAMER_col: 0.45
:END:
#+begin_src emacs-lisp
(->>  10
      (- 5)
      (+ 7)
      (* 3))
#+end_src

#+RESULTS:
: 6

** Example: Implementing Python's list comprehensions
Task: Extend =elisp= to add support for list comprehension.
#+BEGIN_SRC python :session py :results verbatim :exports both
[x for x in range(10) if not (x % 2)]
#+END_SRC

#+RESULTS:
: [0, 2, 4, 6, 8]

** Example: Implementing Python's list comprehensions
:PROPERTIES:
:BEAMER_opt: shrink=35
:END:
#+begin_src emacs-lisp :tangle yes :exports code
(defmacro lcomp (expression for var in list conditional conditional-test)
  (let ((result (gensym)))
    ;; the arguments are really code so we can substitute them
    ;; store nil in the unique variable name generated above
    `(let ((,result nil))
       ;; var is a variable name
       ;; list is the list literal we are suppose to iterate over
       (cl-loop for ,var in ,list
            ;; conditional is if or unless
            ,conditional ,conditional-test
            ;; and this is the action from the earlier lisp example
            do (setq ,result (append ,result (list ,expression))))
           ;; return the result
       ,result)))

(defun range (to) (number-sequence 0 (1- to )))
#+end_src

#+RESULTS:
: range

#+begin_src emacs-lisp
(lcomp x for x in (range 10) if (= (mod x 2) 0))
#+end_src

#+RESULTS:
: (0 2 4 6 8)



